<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"bdfb1b4bb5c275b29d1697163d3a71c1bb236d1c9083048aaa656c445f0e1e21","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #810 at https://github.com/cal-itp/data-infra/actions/runs/18548343273","plan_out_hash":"2cf87a24b703d032b28d6e4fdc5a4bb53b761dd50d4da2c076216ccef49d36f8","plan_hash":"8bbd4139a47305d94ab1ca77059af7d41a5213c99ee720ad116f5f8ff29b8a97","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "cTMNcQ==" -> (known after apply)
!~      detect_md5hash      = "2a2cGwV6s/MNibNqKgsi/g==" -> "different hash"
!~      generation          = 1760568643098206 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "2a2cGwV6s/MNibNqKgsi/g==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/audit/_mart_audit.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "waR2eg==" -> (known after apply)
!~      detect_md5hash      = "VihuHbwo2n9vDyUrdfbV/A==" -> "different hash"
!~      generation          = 1760576380486400 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/audit/_mart_audit.yml"
!~      md5hash             = "VihuHbwo2n9vDyUrdfbV/A==" -> (known after apply)
        name                = "data/warehouse/models/mart/audit/_mart_audit.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/audit/fct_bigquery_data_access.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "Y/p4oQ==" -> (known after apply)
!~      detect_md5hash      = "b+ajCuGyx9EUBX+RYSjWeA==" -> "different hash"
!~      generation          = 1760576380486762 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/audit/fct_bigquery_data_access.sql"
!~      md5hash             = "b+ajCuGyx9EUBX+RYSjWeA==" -> (known after apply)
        name                = "data/warehouse/models/mart/audit/fct_bigquery_data_access.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "M3MkcQ==" -> (known after apply)
!~      detect_md5hash      = "5pAnyymY7ddsXCPSlZtyyA==" -> "different hash"
!~      generation          = 1760568644440326 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "5pAnyymY7ddsXCPSlZtyyA==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #810](https://github.com/cal-itp/data-infra/actions/runs/18548343273)